cool/tutorials/compressible/sonicFoam/ras/prism/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1000;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 1000;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 1000;
        value           uniform 1000;
    }
    bottomWall
    {
        type            inletOutlet;
        inletValue      uniform 1000;
        value           uniform 1000;
    }
    topWall
    {
        type            inletOutlet;
        inletValue      uniform 1000;
        value           uniform 1000;
    }
    prismWall
    {
        type            compressible::kqRWallFunction;
        value           uniform 1000;
    }
    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
